n = int(input())

# 1 -> 1/1                  1개
# 2 -> 1/2 2/1              2개
# 3 -> 3/1 2/2 1/3          3개
# 4 -> 1/4 2/3 3/2 4/1      4개
# 5 -> 5/1 4/2 3/3 2/4 1/5  5개 ---> n(n+1)/2

# a/b ... b/a

x = 0  # 구간
while n > (x*(x+1))/2:
    x += 1

if n == 1:
    a = 1
    b = 1

# n = (x+1)x/2
# n = 7, x = 4 -> 10
# n = 6, x = 3 -> 3*4/2 -> 6

else:
    if (x % 2) == 0:  # 구간이 짝수
        a = 1
        b = x
        for i in range(int((x*(x-1))/2), n-1):  # 그 전 구간(x-1)의 마지막 순서부터 n-1까지
            a += 1
            b -= 1
    else:           # 구간이 홀수
        a = x
        b = 1
        for i in range(int((x*(x-1))/2), n-1):
            a -= 1
            b += 1

print('{0}/{1}'.format(a, b))
